"""
БЫСТРЫЙ СТАРТ И КОНФИГУРАЦИЯ
"""

# ============================================================================
# УСТАНОВКА И ЗАПУСК
# ============================================================================

"""
ШАГИ ДЛЯ БЫСТРОГО СТАРТА:

1. Установить зависимости:
   pip install -r requirements.txt

2. Запустить основной бот:
   python bot.py

3. Посмотреть примеры:
   python examples.py

4. Проверить логи и файл posts.json
"""


# ============================================================================
# ПРИМЕР 1: МИНИМАЛЬНЫЙ КОД
# ============================================================================

def minimal_example():
    """Самый простой способ использования"""
    from bot import AutoPostBot
    
    # Создать бота
    bot = AutoPostBot()
    
    # Опубликовать пост
    bot.publish_post("Привет мир!")
    
    # Все. Бот работает!


# ============================================================================
# ПРИМЕР 2: С УДАЛЕНИЕМ ЧЕРЕЗ ВРЕМЯ
# ============================================================================

def example_auto_delete():
    """Пост, который удаляется сам"""
    from bot import AutoPostBot
    
    bot = AutoPostBot()
    
    # Пост удалится через 1 час
    post_id = bot.publish_post(
        content="Это временный пост",
        delete_after_hours=1
    )
    
    print(f"Пост #{post_id} удалится через 1 час")


# ============================================================================
# ПРИМЕР 3: ПЛАНИРОВАНИЕ НА КОНКРЕТНОЕ ВРЕМЯ
# ============================================================================

def example_schedule_at_time():
    """Запланировать пост на конкретное время"""
    from bot import AutoPostBot
    from datetime import datetime, timedelta
    import pytz
    
    bot = AutoPostBot()
    
    # В 18:00 NSK сегодня
    now = datetime.now(pytz.UTC)
    # Предположим, текущее время 10:00 UTC, а 18:00 NSK = 11:00 UTC
    target_time = now.replace(hour=11, minute=0)
    
    post_id = bot.publish_post_at_time(
        content="Пост в 18:00 NSK",
        publish_time=target_time,
        from_tz="UTC"
    )
    
    print(f"Пост запланирован на целевое время")


# ============================================================================
# ПРИМЕР 4: РАБОТА С ВРЕМЕНЕМ ИЗ МОСКВЫ
# ============================================================================

def example_moscow_time():
    """Конвертация времени из Москвы"""
    from bot import AutoPostBot
    from datetime import datetime
    
    bot = AutoPostBot()
    
    # Встреча в Москве на 15:30
    moscow_time = datetime(2026, 2, 23, 15, 30)
    
    # Преобразовать в NSK
    nsk_time = bot.convert_to_nsk_time(moscow_time, from_tz="Europe/Moscow")
    
    print(f"Москва 15:30 = NSK {nsk_time.strftime('%H:%M')}")
    # Результат: Москва 15:30 = NSK 18:30 (NSK на 3 часа впереди)


# ============================================================================
# ПРИМЕР 5: УПРАВЛЕНИЕ ПОСТАМИ
# ============================================================================

def example_post_management():
    """Управление опубликованными постами"""
    from bot import AutoPostBot
    
    bot = AutoPostBot()
    
    # Опубликовать пост
    post_id = bot.publish_post("Новый пост!")
    
    # Получить информацию о посте
    post_info = bot.get_post(post_id)
    print(f"Статус: {post_info['status']}")
    print(f"Содержание: {post_info['content']}")
    print(f"Опубликовано: {post_info['published_at']}")
    
    # Получить все посты
    all_posts = bot.list_posts()
    print(f"Всего постов: {len(all_posts)}")
    
    # Только опубликованные
    published = bot.list_posts(status='published')
    print(f"Опубликовано: {len(published)}")
    
    # Только запланированные
    scheduled = bot.list_posts(status='scheduled')
    print(f"Запланировано: {len(scheduled)}")
    
    # Удалить пост
    bot.delete_post(post_id)
    print(f"Пост #{post_id} удален")


# ============================================================================
# ПРИМЕР 6: ПОЛУЧЕНИЕ ТЕКУЩЕГО ВРЕМЕНИ
# ============================================================================

def example_current_time():
    """Получить текущее время в NSK"""
    from bot import AutoPostBot
    
    bot = AutoPostBot()
    
    # Текущее время в Новосибирске
    nsk_now = bot.get_current_nsk_time()
    
    print(f"Текущее время NSK: {nsk_now.strftime('%Y-%m-%d %H:%M:%S')}")
    
    # Прямой доступ к компонентам
    year = nsk_now.year
    month = nsk_now.month
    day = nsk_now.day
    hour = nsk_now.hour
    minute = nsk_now.minute


# ============================================================================
# ПРИМЕР 7: ПОЛНЫЙ ЦИКЛ РАБОТЫ
# ============================================================================

def example_full_workflow():
    """Полный цикл работы бота"""
    from bot import AutoPostBot
    from datetime import datetime, timedelta
    import pytz
    
    print("\n" + "="*60)
    print("ПОЛНЫЙ ЦИКЛ РАБОТЫ БОТА")
    print("="*60)
    
    # 1. Инициализация
    bot = AutoPostBot()
    print("\n✅ Бот инициализирован")
    
    # 2. Получение текущего времени
    nsk_now = bot.get_current_nsk_time()
    print(f"\n🕐 Текущее время NSK: {nsk_now.strftime('%Y-%m-%d %H:%M:%S')}")
    
    # 3. Публикация первого поста
    post1_id = bot.publish_post(
        content="Пост 1: Опубликовано сейчас",
        delete_after_hours=1
    )
    print(f"\n📝 Пост #{post1_id} опубликован (удалится через 1 час)")
    
    # 4. Планирование второго поста
    future_time = nsk_now + timedelta(hours=2)
    post2_id = bot.publish_post_at_time(
        content="Пост 2: Будет опубликован через 2 часа",
        publish_time=future_time,
        from_tz="UTC"
    )
    print(f"\n📅 Пост #{post2_id} запланирован на {future_time.strftime('%H:%M')}")
    
    # 5. Получение информации
    print("\n📊 Информация о постах:")
    for post in bot.list_posts():
        print(f"   #{post['id']}: {post['content'][:40]}... ({post['status']})")
    
    # 6. Получение информации о планировщике
    print("\n⏰ Запланированные задания:")
    for job in bot.get_jobs_info():
        print(f"   {job['id']}: {job['next_run_time']}")
    
    # 7. Статус
    print("\n✨ Цикл успешно завершен!")


# ============================================================================
# КОНФИГУРАЦИЯ ДЛЯ РАЗНЫХ СЦЕНАРИЕВ
# ============================================================================

class BotConfigs:
    """Готовые конфигурации для разных задач"""
    
    @staticmethod
    def config_daily_posts():
        """Конфиг для ежедневных постов"""
        from bot import AutoPostBot
        from datetime import datetime, timedelta
        import pytz
        
        bot = AutoPostBot()
        
        # Каждый день в 10:00 NSK опубликовать пост
        nsk_tz = pytz.timezone('Asia/Novosibirsk')
        daily_time = datetime.now(nsk_tz).replace(hour=10, minute=0, second=0)
        
        return bot, daily_time
    
    @staticmethod
    def config_cleanup():
        """Конфиг для удаления постов старше 7 дней"""
        from bot import AutoPostBot
        from datetime import timedelta
        
        bot = AutoPostBot()
        return bot, timedelta(days=7)
    
    @staticmethod
    def config_business_hours():
        """Публиковать посты только в рабочее время (9-18 NSK)"""
        from bot import AutoPostBot
        
        bot = AutoPostBot()
        business_hours = {
            'start': 9,
            'end': 18,
            'timezone': 'Asia/Novosibirsk'
        }
        return bot, business_hours


# ============================================================================
# СОВЕТЫ И ТРЮКИ
# ============================================================================

"""
💡 СОВЕТЫ:

1. ПРЕОБРАЗОВАНИЕ ВРЕМЕНИ:
   - Всегда используйте convert_to_nsk_time() для преобразования
   - При планировании указывайте часовой пояс через from_tz
   
2. УДАЛЕНИЕ ПОСТОВ:
   - Используйте delete_after_hours для автоматического удаления
   - Или вызовите delete_post() в нужный момент
   
3. ПЛАНИРОВАНИЕ:
   - Используйте publish_post_at_time() для планирования
   - Убедитесь, что время в будущем
   
4. ХРАНЕНИЕ:
   - Посты автоматически сохраняются в posts.json
   - При перезагрузке бота, посты загружаются из файла
   - Планы удаления восстанавливаются при старте
   
5. ПЕРФОРМАНС:
   - На одном боте можно управлять сотнями постов
   - APScheduler эффективно обрабатывает много задач
   - Логирование можно отключить для лучшей перформанс
   
6. ЛОГИРОВАНИЕ:
   - Все события логируются
   - Проверьте логи если что-то не работает
   - Уровень логирования: INFO по умолчанию
   
7. ИНТЕГРАЦИИ:
   - Используйте TelegramAutoPostBot для Telegram
   - Используйте VKAutoPostBot для ВКонтакте
   - Используйте MultiPlatformAutoPostBot для нескольких платформ
   
8. ВОССТАНОВЛЕНИЕ:
   - Если бот упал, посты сохраняются в posts.json
   - Запланированные задачи будут восстановлены при запуске
   - Пост, который должен был быть опубликован пока бот был выключен,
     будет опубликован по запуску
"""


# ============================================================================
# ЗАПУСК ПРИМЕРОВ
# ============================================================================

if __name__ == "__main__":
    import sys
    
    print("\n" + "█"*60)
    print("█  АВТОПОСТИНГ БОТ - ПРИМЕРЫ ИСПОЛЬЗОВАНИЯ".center(60) + "█")
    print("█"*60)
    
    examples = {
        '1': ('Минимальный код', minimal_example),
        '2': ('С удалением через время', example_auto_delete),
        '3': ('Планирование на конкретное время', example_schedule_at_time),
        '4': ('Работа с московским временем', example_moscow_time),
        '5': ('Управление постами', example_post_management),
        '6': ('Получение текущего времени', example_current_time),
        '7': ('Полный цикл работы', example_full_workflow),
    }
    
    print("\nДоступные примеры:")
    for key, (name, _) in examples.items():
        print(f"  {key}. {name}")
    print("  0. Выход")
    
    choice = input("\nВыберите пример (0-7): ").strip()
    
    if choice in examples:
        name, func = examples[choice]
        print(f"\n▶ Запуск: {name}\n")
        try:
            func()
        except Exception as e:
            print(f"\n❌ Ошибка: {e}")
            import traceback
            traceback.print_exc()
    elif choice == '0':
        print("Выход...")
    else:
        print("❌ Неверный выбор")
    
    print("\n" + "█"*60)
